{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 998, 64, 1],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv1",
          "trainable": false,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["input_2", 0, 0, {}]]]
      },
      {
        "name": "pool1",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "pool1",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["conv1", 0, 0, {}]]]
      },
      {
        "name": "conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2",
          "trainable": false,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["pool1", 0, 0, {}]]]
      },
      {
        "name": "pool2",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "pool2",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["conv2", 0, 0, {}]]]
      },
      {
        "name": "conv3/conv3_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv3/conv3_1",
          "trainable": false,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["pool2", 0, 0, {}]]]
      },
      {
        "name": "conv3/conv3_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv3/conv3_2",
          "trainable": false,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["conv3/conv3_1", 0, 0, {}]]]
      },
      {
        "name": "pool3",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "pool3",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["conv3/conv3_2", 0, 0, {}]]]
      },
      {
        "name": "conv4/conv4_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv4/conv4_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 512,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["pool3", 0, 0, {}]]]
      },
      {
        "name": "conv4/conv4_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv4/conv4_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 512,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["conv4/conv4_1", 0, 0, {}]]]
      },
      {
        "name": "reshape_1",
        "class_name": "Reshape",
        "config": {
          "name": "reshape_1",
          "trainable": true,
          "dtype": "float32",
          "target_shape": [124, 4096]
        },
        "inbound_nodes": [[["conv4/conv4_2", 0, 0, {}]]]
      },
      {
        "name": "pool4",
        "class_name": "GlobalMaxPooling1D",
        "config": {
          "name": "pool4",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["reshape_1", 0, 0, {}]]]
      },
      {
        "name": "fc1",
        "class_name": "Dense",
        "config": {
          "name": "fc1",
          "trainable": true,
          "dtype": "float32",
          "units": 2048,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["pool4", 0, 0, {}]]]
      },
      {
        "name": "fc2",
        "class_name": "Dense",
        "config": {
          "name": "fc2",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["fc1", 0, 0, {}]]]
      },
      {
        "name": "classifier",
        "class_name": "Dense",
        "config": {
          "name": "classifier",
          "trainable": true,
          "dtype": "float32",
          "units": 8,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["fc2", 0, 0, {}]]]
      }
    ],
    "input_layers": [["input_2", 0, 0]],
    "output_layers": [["classifier", 0, 0]]
  },
  "keras_version": "2.3.1",
  "backend": "tensorflow"
}
